test/0/U
/*--------------------------------*-
C++
-*----------------------------------*\
|
=========
|
|
|
\\
/
F
ield
|
OpenFOAM:
The
Open
Source
CFD
Toolbox
|
|
\\
/
O
peration
|
Version:
2.1.1
|
|
\\
/
A
nd
|
Web:
www.OpenFOAM.org
|
|
\\/
M
anipulation
|
|
\*---------------------------------------------------------------------------*/
FoamFile
{

version
2.0;

format
ascii;

class
volVectorField;

object
U;
}
//
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
0
constant
Mesh_1.unv
system
//

dimensions
[0
1
-1
0
0
0
0];

internalField
uniform
(0
0
0);

boundaryField
{

movingWall

    outlet_pipe
    {
        type            symmetryPlane;
    }
    back
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    in_plane
    {
        type            zeroGradient;
    }
    out_plane
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    inlet_pipe
    {
        type            zeroGradient;
    }
}
// ************************************************************************* //
