test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
10
(
    outlet_pipe
    {
        type            wall;
        nFaces          384;
        startFace       54199;
    }
    back
    {
        type            wall;
        nFaces          1548;
        startFace       54583;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       56131;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       56195;
    }
    front
    {
        type            wall;
        nFaces          4026;
        startFace       56259;
    }
    in_plane
    {
        type            wall;
        nFaces          364;
        startFace       60285;
    }
    out_plane
    {
        type            wall;
        nFaces          364;
        startFace       60649;
    }
    top
    {
        type            wall;
        nFaces          288;
        startFace       61013;
    }
    bottom
    {
        type            wall;
        nFaces          288;
        startFace       61301;
    }
    inlet_pipe
    {
        type            wall;
        nFaces          384;
        startFace       61589;
    }
)
// ************************************************************************* //
